In [14]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib as mpl
mpl.rc('font',family='Malgun Gothic')
import seaborn as sns
import scipy.stats as stats
df_ROS = pd.read_csv('../../datasets/TitanicFromDisaster_train.csv')
df_ROS.head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

## Quest
- 범주형 / 범주형 확증 데이터 검증
- 연속형 / 연속형 확증 데이터 검증

In [15]:
df_ROS.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [16]:
df_ROS[['Survived','Pclass']]=df_ROS[['Survived','Pclass']].astype(object)

In [17]:
df_ROS.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    object
 2   Pclass       891 non-null    object
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(3), object(7)
memory usage: 83.7+ KB

### x는 범부형, y는 범주형

#### 선정 변수 : Pclass 에 따라 Survived 가 달라지는가?
- 분석내용 : 
    - 귀무가설 : Pclass 에 따라 Survived 가 달라지지않는다.
    - 대립가설 : Pclass 에 따라 Survived 가 달라진다.
- 분석 결론(기준:p-value 0.05)
    - 통계 결론 : 귀무가설 참 (pvalue=4.549251711298793e-23)
    - 사실 결론 : Pclass에 따라 Survived 가 달라지지 않는다.

In [22]:
df_ROS[['Pclass','Survived']].describe()

        Pclass  Survived
count      891       891
unique       3         2
top          3         0
freq       491       549

In [23]:
df_ROS_ps = df_ROS[['Pclass','Survived']]

In [24]:
df_ROS_ps_pivot = pd.pivot_table(data=df_ROS_ps, index='Pclass', columns='Survived',aggfunc=len)

In [25]:
stats.chi2_contingency(observed=df_ROS_ps_pivot, correction=True)

Chi2ContingencyResult(statistic=102.88898875696056, pvalue=4.549251711298793e-23, dof=2, expected_freq=array([[133.09090909,  82.90909091],
       [113.37373737,  70.62626263],
       [302.53535354, 188.46464646]]))

### x는 연속형, y는 연속형

#### 선정 변수 : Age 에 따라 Fare 가 달라지는가?
- 분석내용 : 
    - 귀무가설 : Age 에 따라 Fare 가 달라지지않는다.
    - 대립가설 : Age 에 따라 Fare 가 달라진다.
- 분석 결론(기준:p-value 0.05)
    - 통계 결론 : 대립가설 참 (pvalue=0.010216277504446952)
    - 사실 결론 : Age증가에 따라 Fare가 같이 비례하여 증가한다.

In [35]:
df_ROS[['Age','Fare']].describe()
df_age_fare = df_ROS[['Age','Fare']]
df_age_fare

      Age     Fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [36]:
df_age_fare.isnull().sum()

Age     177
Fare      0
dtype: int64

In [37]:
df_age_fare = df_age_fare.dropna().copy()
df_age_fare.corr()

           Age      Fare
Age   1.000000  0.096067
Fare  0.096067  1.000000

In [38]:
stats.pearsonr(df_age_fare['Age'],df_age_fare['Fare'])

PearsonRResult(statistic=0.0960666917690389, pvalue=0.010216277504446952)